package ru.progwards.t2.n2_3;

//литералы - это неизменяемые значения
public class Example {
    //целочисленные
    byte b= 100;
    short s = 1000;
    int i1 = 555;
    long l = 123456789012345L ; //или l

    //с плавающей точкой
    double d1 = 567.89;
    double d2 = 5.6789e2;
    double d3 = 56789e-2;
    double d11 = 567.89d; //или D
    float f1 = 100.123f; //или F
    float f2 = 1.00123e2F;

    //символьные и строковые литералы

    char bigZ = 'Z' ; //всегда одинарные кавычки для символов
    String str = "Это строка"; //всегда двойные кавычки для строк
}
